In [43]:
import numpy as np
import pandas as pd
import random as rd

In [44]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### 1.1 Create index

In [45]:
# Create an array using np
new_index = np.arange(0,1000)
len(new_index)

1000

In [46]:
# shuffling the array
rd.shuffle(new_index)
new_index

array([181, 558,  50, 169, 648, 282, 180, 342, 826, 419, 798, 801, 552,
       941, 830, 510, 872,  16, 132, 746, 988, 421, 752, 928, 719,  94,
        98, 272, 473, 925, 153, 427, 888, 104, 912, 612, 910,  44, 276,
       590, 355, 414, 847, 753, 736,  55, 712, 802,  61, 843, 464, 281,
       703, 715, 537, 605,  29, 248, 188,  95, 514, 528, 986, 902, 313,
       601, 285, 839, 683, 157,  54, 501, 460, 971, 478, 717, 334, 240,
       776, 757, 205, 669, 569,  70, 379, 745, 279, 255, 568, 915, 675,
        89, 987, 602, 535, 502, 384, 816, 178, 392, 145, 992, 851, 450,
       497,  57, 639, 922, 862, 117, 329, 500, 348, 599, 275, 526, 547,
       800, 114,  79, 221,  86, 657, 403, 125, 241,   3, 127, 434, 529,
       481, 152, 325, 787, 259, 903, 638, 820,  56, 760, 531, 433,  51,
       441, 948, 374, 828, 608, 842, 926, 635, 878, 357, 236, 199,  48,
       705, 112, 597, 726, 228, 940, 527, 345, 949, 202, 245, 645, 175,
        77, 677, 138, 575, 207, 376, 968, 744, 644, 600, 835, 709, 578,
       533, 470, 855, 201, 203,  41, 914, 110, 225, 316, 707,  85, 933,
        82, 150, 359, 100, 865, 292, 664, 945, 373, 702, 139,  92, 563,
       301, 858, 551, 693, 140, 595, 173,   2, 134,   1,  26, 350,  10,
       516, 155, 277, 244, 455, 606, 832, 315, 793,  31, 260, 972, 885,
       629, 113, 646, 741, 559, 970, 321, 845, 640, 571, 369, 385,  67,
       797, 209, 415, 177, 786, 335, 761,  21, 439, 896, 243, 632, 399,
       356, 671, 870, 631, 641, 866, 779, 764, 122, 981, 993,  35, 166,
       511, 428, 354, 505, 413, 813, 852, 167, 227, 204, 999, 749, 328,
       818, 290, 566, 137, 775, 337, 931,  39, 119, 299, 765, 684, 808,
       952, 924, 220, 453, 840, 532, 782, 298, 564, 461, 884, 294, 319,
       269, 179, 375, 998, 911,  34, 101, 731, 589, 963, 312, 270, 908,
       273, 976, 509, 699, 994, 296, 142, 805, 417, 261, 770, 661, 991,
       795, 874, 951, 253, 682, 936, 154, 739, 788, 222, 869, 425, 231,
       530, 624, 380,  28, 393, 121, 611, 889, 396,   6, 333, 522, 577,
       159, 465, 280, 352, 323, 317,  49, 483, 429, 536, 713,  64, 234,
       678, 103, 520, 247, 230,  47, 148, 436, 626, 218, 176, 724, 217,
       906, 405, 310, 190, 927, 506, 789, 378, 604,  32, 854,   9, 917,
       877, 475, 740, 827, 365, 210, 256, 486, 492, 650, 411, 351, 670,
       769, 251, 288, 584, 649, 666, 587,  33, 565, 938, 327, 919, 904,
        11, 438, 995, 193, 424, 785, 881, 977, 410, 868, 943, 371, 508,
       598, 857, 242, 681, 921, 893, 920, 394, 576, 672, 443, 593, 388,
       873, 983, 106, 950, 437, 706, 918, 728,  27, 264, 487, 147, 811,
       200,  19, 792, 863, 634, 358, 163, 136, 471,  18, 198, 990, 386,
       254, 490, 633, 412, 732, 747, 985, 767, 322, 124, 997, 935, 557,
       383, 642, 146, 266, 846, 524, 143, 219,  99, 349, 969, 295, 215,
       882, 974,  58, 364, 947, 326, 107, 462, 161, 694, 382,  65, 300,
       964, 662, 543, 548, 368, 229, 607, 615, 389, 907, 679,  91, 613,
       390, 627, 942, 422, 336, 542, 614, 545, 656, 667, 772, 962, 274,
       960, 237, 284, 129, 929, 850, 432,  68, 959, 305, 476, 594, 909,
       796, 727, 525, 689, 291, 953, 539, 647, 518,  83, 391, 665, 488,
       711, 777, 286, 208, 934, 673, 187, 381, 451, 216, 654, 756, 799,
       853, 954, 494, 695, 479, 338, 663, 692, 401,   0, 831, 503, 690,
       984, 430, 366, 750, 570, 128, 574, 353, 546, 212, 900,  97,   8,
       625,  20,  25, 162, 708, 512, 108, 482, 685, 447, 579, 347, 195,
       307, 416,   4, 978, 211, 519, 730, 806, 652, 774, 320,  38, 944,
       444,  93, 311, 856, 265, 821, 409, 616, 233, 773, 408, 553, 404,
       894, 467,  60, 659, 372, 267,  76, 446, 955,  24,  72, 688, 395,
       829, 144, 332, 651, 449, 966, 495, 932, 810, 172, 643, 258,  14,
        17, 585, 131, 762, 118, 766, 875, 961, 120, 562, 676, 899,  53,
       249, 549, 498, 980,  13, 398, 790,   7, 454, 982, 363, 887, 833,
       426, 622, 686, 734, 442, 534, 246, 191, 697, 469, 754, 418, 930,
       861, 523, 573, 583, 111, 901, 743, 623, 507,  59, 763, 341, 655,
       158,  62, 923,  45,  87, 617, 864, 223, 435, 504, 784, 836, 126,
       185, 751, 362, 973, 838, 592, 939, 834,  36, 572, 517, 308, 186,
       958, 687, 484, 135, 493, 824, 905, 791, 238, 755, 809, 431, 700,
       407,  30, 331, 268, 860, 781, 164, 867,  12, 619, 463, 339, 377,
        63, 224, 759, 603, 109, 758, 141, 886, 582, 250, 580, 232, 817,
       729, 916, 491,  22, 194, 406, 257, 975, 794, 521, 967, 448, 653,
       283, 890, 165, 956, 660, 263, 588,  23, 271, 823, 618,  80, 367,
       452, 168, 477, 771, 226, 472, 783, 880, 304, 844, 235, 979, 859,
       361, 541, 287,  37, 610, 892,  52, 306, 668, 628, 182, 620, 725,
       704, 780, 849, 174,  40, 658, 513, 738, 466, 721, 722, 102, 898,
       913, 440, 149, 397, 400, 698, 609, 996, 879, 457, 716, 239, 468,
       116, 123, 309,  46, 213, 556, 848, 330, 293, 485, 723, 778, 735,
       318, 544, 554, 278, 636, 710, 387, 171,  84, 420, 303, 957, 591,
       297, 197, 748, 480, 876, 489, 183, 151, 474, 737, 803, 206, 841,
        15, 718, 445, 742, 883, 192, 360, 459, 567,  71, 189, 596,  78,
       946, 822,   5, 540, 825, 680, 133, 344, 937, 581, 423,  74, 837,
       370, 621, 496, 314, 630, 170, 184, 340, 499,  88,  96, 402, 733,
       262, 561, 515, 714, 560, 538, 637,  69,  90, 989, 343, 324, 768,
       819,  81, 550, 586, 691, 289,  43, 701, 160, 696, 105, 115, 674,
       346, 814, 807, 456, 302,  42,  75,  66, 555, 871, 252, 895, 458,
       815, 156, 214, 720, 804, 812,  73, 130, 965, 891, 897, 196])

In [47]:
# Adding new col in df
df_exams['new_index'] = new_index

In [48]:
# displaying the df
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new_index
0,female,group B,bachelor's degree,standard,none,72,72,74,181
1,female,group C,some college,standard,completed,69,90,88,558
2,female,group B,master's degree,standard,none,90,95,93,50
3,male,group A,associate's degree,free/reduced,none,47,57,44,169
4,male,group C,some college,standard,none,76,78,75,648

### 1.2 Set index() method

In [49]:
# Set new add col as index of DF
df_exams.set_index('new_index')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new_index,,,,,,,,
181,female,group B,bachelor's degree,standard,none,72,72,74
558,female,group C,some college,standard,completed,69,90,88
50,female,group B,master's degree,standard,none,90,95,93
169,male,group A,associate's degree,free/reduced,none,47,57,44
648,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
130,female,group E,master's degree,standard,completed,88,99,95
965,male,group C,high school,free/reduced,none,62,55,55
891,female,group C,high school,free/reduced,completed,59,71,65
897,female,group D,some college,standard,completed,68,78,77
196,female,group D,some college,free/reduced,none,77,86,86

### 1.3 Sort Index() method

In [50]:
# sort dataframe by new index
df_exams.sort_index()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new_index
0,female,group B,bachelor's degree,standard,none,72,72,74,181
1,female,group C,some college,standard,completed,69,90,88,558
2,female,group B,master's degree,standard,none,90,95,93,50
3,male,group A,associate's degree,free/reduced,none,47,57,44,169
4,male,group C,some college,standard,none,76,78,75,648
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,130
996,male,group C,high school,free/reduced,none,62,55,55,965
997,female,group C,high school,free/reduced,completed,59,71,65,891
998,female,group D,some college,standard,completed,68,78,77,897
999,female,group D,some college,free/reduced,none,77,86,86,196

### 2. Rename Column

In [51]:
# Rename col and overwrite values of the dataframe
df_exams = df_exams.rename(columns={'gender': 'Gender'})
df_exams.head()

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new_index
0,female,group B,bachelor's degree,standard,none,72,72,74,181
1,female,group C,some college,standard,completed,69,90,88,558
2,female,group B,master's degree,standard,none,90,95,93,50
3,male,group A,associate's degree,free/reduced,none,47,57,44,169
4,male,group C,some college,standard,none,76,78,75,648

In [52]:
# Renaming multiple columns 
df_exams.rename(columns={'math score': 'MS', 'writing score': 'WS', 'rs': 'RS'}, inplace=True)

In [54]:
df_exams.head()

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,reading score,WS,new_index
0,female,group B,bachelor's degree,standard,none,72,72,74,181
1,female,group C,some college,standard,completed,69,90,88,558
2,female,group B,master's degree,standard,none,90,95,93,50
3,male,group A,associate's degree,free/reduced,none,47,57,44,169
4,male,group C,some college,standard,none,76,78,75,648

### 3 Rename Index

In [70]:

df_exams = df_exams.sort_values('new_index')
df_exams.head()

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,reading score,WS
new_index,,,,,,,,
0,female,group C,bachelor's degree,standard,completed,92,100,99
1,female,group C,high school,free/reduced,none,34,42,39
2,male,group B,some high school,standard,completed,84,83,75
3,male,group B,some high school,standard,none,72,68,67
4,male,group B,associate's degree,free/reduced,completed,69,70,63

In [71]:
# rename the index
df_exams.rename(index={0: 'A', 1: 'a', 2: 'B'}, inplace=True)
df_exams.head()

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,reading score,WS
new_index,,,,,,,,
A,female,group C,bachelor's degree,standard,completed,92,100,99
a,female,group C,high school,free/reduced,none,34,42,39
B,male,group B,some high school,standard,completed,84,83,75
3,male,group B,some high school,standard,none,72,68,67
4,male,group B,associate's degree,free/reduced,completed,69,70,63